/* BMI calculator */

/* Input */
Say 'Enter your height in meters please'
pull height
Say 'Enter your weight in kilograms please'
pull weight

/* Calculation */
bmi =(weight/(height * height))

/* Output */
say "Your BMI is" bmi
