/* REXX */
Say "This is Electric Energy Calculator in joules for ECT"
Say 'Please, enter the voltage in volts'
Pull V
Say 'Please, enter the current in amperes'
Pull I
Say 'Please, enter the duration in seconds'
Pull t
E = V * I * t
Say 'The electric energy is' E 'Joules'
