/*REXX*/
Say 'This is hip-waiste ratio calculator'
Say 'Please, enter the waiste circumference'
Pull W
Say 'Please, enter the hip circumference'
Pull H
R = W/H
Say 'The Hip-Waiste Ratio is' R
