/* REXX */
Say "This is Ohm's Law Voltage Calculator"
Say 'Please, enter the current in Amperes'
Pull I
Say 'Please, enter the resistance in Ohms'
Pull R
V = I*R
Say 'The voltage is' V 'v'
