/* REXX */
Say "Power Calculator in Watts"
Say 'Please, enter the current in Amperes'
Pull I
Say 'Please, enter the voltage in volts'
Pull v
P = V*I
Say 'The power is' P 'w.'
